<?php 

  $error_code  = array(
      '200'=>'成功',
      '500'=>'非法请求',
      '502'=>'服务器未知错误',
      '101001'=>'请先登录',
      '101002'=>'项目名称为空',
      '101003'=>'项目简介为空',
      '101004'=>'创建项目失败',
      '101005'=>'修改项目失败',
      '101006'=>'openid为空',
      '101007'=>'商户ID为空',
      '101008'=>'行为类型id错误',
      '101009'=>'用户不存在',
      '40001'=>'appid或者appkey错误',
      '40002'=>'access_token错误或者过期',
      '40003'=>'grant_type参数错误',
      '40004'=>'商户权限错误',
      '40005'=>'appid或者sign错误',
      '49999'=>'未知错误',
  );
  
?>